#!/bin/bash



echo "Привет, мир!"


export PS1="\d:\u:\w\!"

read ADDRESS


export $ADDRESS

echo Привет $ADDRESS


echo $HOME
# Переменные среды
# BASH - полный путь до исполняемого файла командной оболочки bash;
# BASH_VERSION - версия bash;
# HOME - домашний каталог пользователя, который запустил сценарий;
# HOSTNAME - имя компьютера;
# RANDOM - случайное число в диапазоне от 0 до 32767;
# OSTYPE - тип операционной системы;
# PWD - текущий каталог;
# PS1 - строка приглашения; 
# UID - ID пользователя, который запустил сценарий; 
# USER - имя пользователя


# Колличество параметров

echo $#
